//Є змінна х, якій ви надаєте довільне числове значення.
//Якщо змінна x не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'.
// Перевірте  скрипт при a, що дорівнює 1, 0, -3

let a = +prompt('Введіть будь яке довільне число  ');
if (a !== 0) {
    console.log('Вірно');
} else {
    console.log('Невірно')
}

let k = 1;
if (k !== 0) {
    console.log('Вірно');
} else {
    console.log('Невірно')
}

let h=0;
if (h !== 0) {
    console.log('Вірно');
} else {
    console.log('Невірнo')}
let p=-3;
if (p !== 0) {
    console.log('Вірно');
} else {
    console.log('Невірнo')}



//Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті
// години попадає число (в першу, другу, третю или четверту частину години).

let time = +prompt('Введіть число від 0 до 59');
if (time > 0 && time <= 15) {
    console.log('Перша чверть години');
} else if (time > 15 && time <= 30) {
    console.log('Друга чверть години');
} else if (time > 30 && time <= 45) {
    console.log('Третя чверть години');
} else if (time > 45 && time <= 59) {
    console.log('Четверта чверть години')
} else {
    console.log('Некореткний запит')
}

// У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє
// це число (у першу, другу чи третю).

let day = +prompt('Введіть число від 1 до 31');
if (day > 1 && day <= 10) {
    console.log('Перша декада місяця');
} else if (time > 10 && time <= 20) {
    console.log('Друга декада місяця')
} else if (time > 20 && time <= 31) {
    console.log('Третя декада місяця')
} else {
    console.log('Некореткний запит')
}


// Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня
// і на екрані відображається інфа що заплановано на цей день (можна замість плану на день, назву дня англійською).

let week = prompt('Введіть порядковий день тижня ');
switch (week) {
    case '1':
        console.log('Практика');
        break;
    case '2':
        console.log(' Теорія');
        break
    case '3':
        console.log('Практика');
        break;
    case '4':
        console.log('Теорія');
        break;
    case '5':
        console.log('Додаткове');
        break;
    case '6':
        console.log('Англійська');
        break;
    case '7':
        console.log('Вихідний');
        break;
    default:
        console.log('Некоректний запит');
}

//Користувач вводить або має два числа.
//Потрібно знайти та вивести максимальне число з тих двох .
//Також потрібно врахувати коли введені рівні числа.

let x = +prompt('Введіть число x');
let y = +prompt('Введіть число y');
if (x > y) {
    console.log(x);
} else if (x < y) {
    console.log(y);
} else if (x === y) {
    console.log(x, y)
} else {
    console.log('Некоректний запит')
}

//є змінна х, яка може прийняти будь-яке значення (стрінг, число, undefined, null  і тд включно).
// Напишіть код якиq за допомоги  оператора || буде присвоювати змінній х значення "default"
// якщо значення змінної х являється falsy (хибноподыбне, тобто кастується до false)

let z = NaN;
if (false || !z) {
    z = 'default'
}
console.log(z);


